src/main/resources/register-user-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
            <us:registerUser>
                <us:userObject>
                    <us:first_name></us:first_name>
                    <us:last_name></us:last_name>
                    <us:email></us:email>
                    <us:phone_number></us:phone_number>
                    <us:password></us:password>
                </us:userObject>
            </us:registerUser>
    </soapenv:Body>
</soapenv:Envelope>